In [22]:
import numpy as np 
import pandas as pd

In [28]:
var ={"Name": ["Ram","Lax","Ram","Sita","Lax","Sita"],
                   "Sub-1" :[94,93,96,90,92,97],
                   "Sub-2":[92,91,94,93,96,91]}
df=pd.DataFrame(var)

In [29]:
df

   Name  Sub-1  Sub-2
0   Ram     94     92
1   Lax     93     91
2   Ram     96     94
3  Sita     90     93
4   Lax     92     96
5  Sita     97     91

In [33]:
grp=df.groupby('Name').min()
print(grp)

      Sub-1  Sub-2
Name
Lax      92     91
Ram      94     92
Sita     90     91